<?
	$arr = [
		"а" => "a",
		"А" => "A",
		"б" => "b",
		"Б" => "B",
		"в" => "v",
		"В" => "V",
		"г" => "g",
		"Г" => "G",
		"д" => "d",
		"Д" => "D",
		"е" => "e",
		"Е" => "E",
		"ё" => "yo",
		"Ё" => "Yo",
		"ж" => "g",
		"Ж" => "G",
		"з" => "z",
		"З" => "Z",
		"и" => "i",
		"И" => "I",
		"й" => "y",
		"Й" => "Y",
		"к" => "k",
		"К" => "K",
		"л" => "l",
		"Л" => "L",
		"м" => "m",
		"М" => "M",
		"н" => "n",
		"Н" => "N",
		"о" => "o",
		"О" => "O",
		"п" => "p",
		"П" => "P",
		"р" => "r",
		"Р" => "R",
		"с" => "s",
		"С" => "S",
		"т" => "t",
		"Т" => "T",
		"у" => "u",
		"У" => "U",
		"ф" => "f",
		"Ф" => "F",
		"х" => "kh",
		"Х" => "Kh",
		"ц" => "c",
		"Ц" => "C",
		"ч" => "ch",
		"Ч" => "Ch",
		"ш" => "sh",
		"Ш" => "Sh",
		"щ" => "shh",
		"Щ" => "Shh",
		"ъ" => "",
		"Ъ" => "",
		"ы" => "u",
		"Ы" => "U",
		"ь" => "",
		"Ь" => "",
		"э" => "eh",
		"Э" => "Eh",
		"ю" => "yu",
		"Ю" => "Yu",
		"я" => "ya",
		"Я" => "Ya"
	];

	function translit($string) {
		global $arr;
		foreach ($arr as $key => $value) {
			$string = str_replace($key, $value, $string);
		}

		$strArr = str_split($string);

		foreach ($strArr as $key => $value) {
			if ($value == " ") {
				$strArr[$key] = "_";
			}
		}

		return implode("", $strArr);
	};

	echo translit("В траве сидел кузнечик");